Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_E407/timeout.c
/************************************************************************************//**
* \file         timeout.c
* \brief        Timer outputs (output compare) driver source file.
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*  Copyright 2019 (c)  by HAN Automotive   http://www.han.nl        All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* Permission is hereby granted, free of charge, to any person obtaining a copy of this 
* software and associated documentation files (the "Software"), to deal in the Software
* without restriction, including without limitation the rights to use, copy, modify, merge,
* publish, distribute, sublicense, and/or sell copies of the Software, and to permit
* persons to whom the Software is furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included in all copies or
* substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
* PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE
* FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
* OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
* DEALINGS IN THE SOFTWARE.
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "timeout.h"                                  /* Timer output driver           */
#include "os.h"                                       /* for operating system          */
#include "errorcodes.h"                               /* for error codes               */
#include "errorList.h"                                /* for error list                */
#include "stm32f4xx.h"                                /* STM32 registers               */
#include "stm32f4xx_conf.h"                           /* STM32 peripheral drivers      */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief timer interrupt priority */
#define TIMEOUT_NVIC_IRQ_PRIO            (configLIBRARY_KERNEL_INTERRUPT_PRIORITY)

/** \brief Sets the number of output capture channels for a timer module. This is
 *         hardware defined.
 */
#define TIMEOUT_MAX_CHANNELS_PER_MODULE  (4)

/** \brief Determines the number of counts for the free running counter. */
#define TIMEOUT_PERIOD_COUNTS            (65536)

/** \brief Macro for easy access to the maximum number of supported timer modules. */
#define TIMEOUT_MODULES_MAX              (sizeof(moduleMapping)/sizeof(moduleMapping[0]))


/****************************************************************************************
* Type definitions
****************************************************************************************/
/**< \brief Structure type with module mapping information. */
typedef struct
{
  TIM_TypeDef *timer_peripheral;
  uint32_t timer_peripheral_clk;
  uint8_t timer_apb_number;
  uint8_t timer_prescale_divider;
  uint8_t timer_nvic_channel;
} tTimeoutModuleMapping;

/**< \brief Structure type with pin mapping information. */
typedef struct
{
  uint32_t peripheral_clk;
  GPIO_TypeDef* port;
  uint16_t pin;
  uint8_t module_idx;
  uint8_t channel_idx;
  uint16_t compare_irq_flg;
  uint16_t polarity_bit;
  uint8_t gpio_af;
  uint16_t pin_source;
} tTimeoutPinMapping;


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static void TimeoutOverflowInterrupt(uint8_t module_id);
static void TimeoutCompareInterrupt(uint8_t pin_id);
static void TimeoutClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT);


/****************************************************************************************
* Constant data declarations
****************************************************************************************/
/** \brief Array with all configuration parameters of a timer module. note that
 *         TIM2-7 and TIM12-14 have a max input clock frequency of 84 Mhz as opposed
 *         to 168 MHz so these modules need an extra prescale divider.
 */
const static tTimeoutModuleMapping moduleMapping[] =
{
  { TIM1,  RCC_APB2Periph_TIM1, 2, 1, TIM1_CC_IRQn             }, /* idx 0: TIMEOUT_MODULE_TIM1  */
  { TIM2,  RCC_APB1Periph_TIM2, 1, 2, TIM2_IRQn                }, /* idx 1: TIMEOUT_MODULE_TIM2  */
  { TIM3,  RCC_APB1Periph_TIM3, 1, 2, TIM3_IRQn                }, /* idx 2: TIMEOUT_MODULE_TIM3  */
  { TIM4,  RCC_APB1Periph_TIM4, 1, 2, TIM4_IRQn                }, /* idx 3: TIMEOUT_MODULE_TIM4  */
  { TIM8,  RCC_APB2Periph_TIM8,  2, 1, TIM8_CC_IRQn            }, /* idx 4: TIMEOUT_MODULE_TIM8  */
  { TIM9,  RCC_APB2Periph_TIM9,  2, 1, TIM1_BRK_TIM9_IRQn      }, /* idx 5: TIMEOUT_MODULE_TIM9  */
  { TIM10, RCC_APB2Periph_TIM10, 2, 1, TIM1_UP_TIM10_IRQn      }, /* idx 6: TIMEOUT_MODULE_TIM10 */
  { TIM11, RCC_APB2Periph_TIM11, 2, 1, TIM1_TRG_COM_TIM11_IRQn }, /* idx 7: TIMEOUT_MODULE_TIM11 */
  { TIM13, RCC_APB1Periph_TIM13, 1, 2, TIM8_UP_TIM13_IRQn      }, /* idx 8: TIMEOUT_MODULE_TIM13 */
  { TIM14, RCC_APB1Periph_TIM14, 1, 2, TIM8_TRG_COM_TIM14_IRQn }  /* idx 9: TIMEOUT_MODULE_TIM14 */
};

/** \brief Array with all configuration parameters of an output capture pin. */
const static tTimeoutPinMapping pinMapping[] =
{
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_9,  TIMEOUT_MODULE_TIM1,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM1,  GPIO_PinSource9  }, /* idx 0:  TIMEOUT_TIM1_PIN_PE9   */
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_11, TIMEOUT_MODULE_TIM1,  1, TIM_IT_CC2, TIM_CCER_CC2P, GPIO_AF_TIM1,  GPIO_PinSource11 }, /* idx 1:  TIMEOUT_TIM1_PIN_PE11  */
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_13, TIMEOUT_MODULE_TIM1,  2, TIM_IT_CC3, TIM_CCER_CC3P, GPIO_AF_TIM1,  GPIO_PinSource13 }, /* idx 2:  TIMEOUT_TIM1_PIN_PE13  */
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_14, TIMEOUT_MODULE_TIM1,  3, TIM_IT_CC4, TIM_CCER_CC4P, GPIO_AF_TIM1,  GPIO_PinSource14 }, /* idx 3:  TIMEOUT_TIM1_PIN_PE14  */
  { RCC_AHB1Periph_GPIOA, GPIOA, GPIO_Pin_5,  TIMEOUT_MODULE_TIM2,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM2,  GPIO_PinSource5  }, /* idx 4:  TIMEOUT_TIM2_PIN_PA5   */
  { RCC_AHB1Periph_GPIOA, GPIOA, GPIO_Pin_6,  TIMEOUT_MODULE_TIM3,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM3,  GPIO_PinSource6  }, /* idx 5:  TIMEOUT_TIM3_PIN_PA6   */
  { RCC_AHB1Periph_GPIOB, GPIOB, GPIO_Pin_5,  TIMEOUT_MODULE_TIM3,  1, TIM_IT_CC2, TIM_CCER_CC2P, GPIO_AF_TIM3,  GPIO_PinSource5  }, /* idx 6:  TIMEOUT_TIM3_PIN_PB5   */
  { RCC_AHB1Periph_GPIOD, GPIOD, GPIO_Pin_12, TIMEOUT_MODULE_TIM4,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM4,  GPIO_PinSource12 }, /* idx 7:  TIMEOUT_TIM4_PIN_PD12  */
  { RCC_AHB1Periph_GPIOD, GPIOD, GPIO_Pin_13, TIMEOUT_MODULE_TIM4,  1, TIM_IT_CC2, TIM_CCER_CC2P, GPIO_AF_TIM4,  GPIO_PinSource13 }, /* idx 8:  TIMEOUT_TIM4_PIN_PD13  */
  { RCC_AHB1Periph_GPIOC, GPIOC, GPIO_Pin_6,  TIMEOUT_MODULE_TIM8,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM8,  GPIO_PinSource6  }, /* idx 9:  TIMEOUT_TIM8_PIN_PC6   */
  { RCC_AHB1Periph_GPIOC, GPIOC, GPIO_Pin_7,  TIMEOUT_MODULE_TIM8,  1, TIM_IT_CC2, TIM_CCER_CC2P, GPIO_AF_TIM8,  GPIO_PinSource7  }, /* idx 10: TIMEOUT_TIM8_PIN_PC7   */
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_5,  TIMEOUT_MODULE_TIM9,  0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM9,  GPIO_PinSource5  }, /* idx 11: TIMEOUT_TIM9_PIN_PE5   */
  { RCC_AHB1Periph_GPIOE, GPIOE, GPIO_Pin_6,  TIMEOUT_MODULE_TIM9,  1, TIM_IT_CC2, TIM_CCER_CC2P, GPIO_AF_TIM9,  GPIO_PinSource6  }, /* idx 12: TIMEOUT_TIM9_PIN_PE6   */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_6,  TIMEOUT_MODULE_TIM10, 0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM10, GPIO_PinSource6  }, /* idx 13: TIMEOUT_TIM10_PIN_PF6  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_7,  TIMEOUT_MODULE_TIM11, 0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM11, GPIO_PinSource7  }, /* idx 14: TIMEOUT_TIM11_PIN_PF7  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_8,  TIMEOUT_MODULE_TIM13, 0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM13, GPIO_PinSource8  }, /* idx 15: TIMEOUT_TIM13_PIN_PF8  */
  { RCC_AHB1Periph_GPIOF, GPIOF, GPIO_Pin_9,  TIMEOUT_MODULE_TIM14, 0, TIM_IT_CC1, TIM_CCER_CC1P, GPIO_AF_TIM14, GPIO_PinSource9  }  /* idx 16: TIMEOUT_TIM14_PIN_PF9  */
};


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief Function pointers for the user specified free running counter overflow
 *         detected interrupt handler. 
 */
static tTimeoutCallbackOverflow counterOverflowDetected[TIMEOUT_MODULES_MAX];

/** \brief Function pointers for the user specified output compare event detected
 *         interrupt handler. 
 */
static tTimeoutCallbackCompareEvent compareEventDetected[TIMEOUT_MODULES_MAX][TIMEOUT_MAX_CHANNELS_PER_MODULE];

