Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_E407/timeout.c
  /* this ISR is shared with others, so make sure this pin is configured before
   * processing this interrupt.
   */
  if (pin_configured[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] == FALSE)
  {
    /* interrupt not for us */
    return;
  }
  /* make sure to read the configured event counter timestamp from the correct channel */
  if (pinMapping[pin_id].channel_idx == 0)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR1;
  }
  else if (pinMapping[pin_id].channel_idx == 1)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR2;
  }
  else if (pinMapping[pin_id].channel_idx == 2)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR3;
  }
  else if (pinMapping[pin_id].channel_idx == 3)
  {
    eventTimestamp = moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral->CCR4;
  }
  /* clear timer module's output compare flag for the channel of the event */
  TimeoutClearITPendingBit(moduleMapping[pinMapping[pin_id].module_idx].timer_peripheral, pinMapping[pin_id].compare_irq_flg);
  /* store compare counter into last compare event counter */
  lastEventCounter[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] = eventTimestamp;
  /* invoke callback to pass on compare event */
  if (compareEventDetected[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx] != NULL)
  {
    compareEventDetected[pinMapping[pin_id].module_idx][pinMapping[pin_id].channel_idx]();
  }
} /*** end of TimeoutCompareInterrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer update channel 1 and the timer 10
**            interrupt channel.
** \return    none.
**
****************************************************************************************/
void Timeout1UpdateTimeout10Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM1, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM1);
  }
  else
  {
    /* --------------- was it a counter overflow event? ------------------------------ */
    if(TIM_GetITStatus(TIM10, TIM_IT_Update) == SET)
    {
      /* process the event */
      TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM10);
    }
    else
    {
      /* --------------- was it an output compare event for the 1st channel? --------- */
      if(TIM_GetITStatus(TIM10, TIM_IT_CC1) == SET)
      {
        /* process the event */
        TimeoutCompareInterrupt(TIMEOUT_TIM10_PIN_PF6);
      }
    }
  }
} /*** end of Timeout1UpdateTimeout10Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer compare channel 1.
** \return    none.
**
****************************************************************************************/
void Timeout1CaptureInterrupt(void)
{
  /* --------------- was it an output compare event for the 1st channel? ------------- */
  if(TIM_GetITStatus(TIM1, TIM_IT_CC1) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PE9);
  }
  /* --------------- was it an output compare event for the 2nd channel? ------------- */
  else if(TIM_GetITStatus(TIM1, TIM_IT_CC2) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PE11);
  }
  /* --------------- was it an output compare event for the 3rd channel? ------------- */
  else if(TIM_GetITStatus(TIM1, TIM_IT_CC3) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PE13);
  }
  /* --------------- was it an output compare event for the 4th channel? ------------- */
  else if(TIM_GetITStatus(TIM1, TIM_IT_CC4) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM1_PIN_PE14);
  }

} /*** end of Timeout1CaptureInterrupt ***/



/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 2.
** \return    none.
**
****************************************************************************************/
void Timeout2Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM2);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM2, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM2_PIN_PA5);
    }
  }
} /*** end of Timeout2Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 3.
** \return    none.
**
****************************************************************************************/
void Timeout3Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM3, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM3);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM3, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM3_PIN_PA6);
    }
    /* --------------- was it an output compare event for the 2nd channel? ----------- */
    else if(TIM_GetITStatus(TIM3, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM3_PIN_PB5);
    }
  }
} /*** end of Timeout3Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 4.
** \return    none.
**
****************************************************************************************/
void Timeout4Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM4, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM4);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM4, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PD12);
    }
    /* --------------- was it an output compare event for the 2nd channel? ----------- */
    else if(TIM_GetITStatus(TIM4, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM4_PIN_PD13);
    }
  }
} /*** end of Timeout4Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer update channel 8 and the timer 13
**            interrupt channel.
** \return    none.
**
****************************************************************************************/
void Timeout8UpdateTimeout13Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM8, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM8);
  }
  else
  {
    /* --------------- was it a counter overflow event? ------------------------------ */
    if(TIM_GetITStatus(TIM13, TIM_IT_Update) == SET)
    {
      /* process the event */
      TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM13);
    }
    else
    {
      /* --------------- was it an output compare event for the 1st channel? --------- */
      if(TIM_GetITStatus(TIM13, TIM_IT_CC1) == SET)
      {
        /* process the event */
        TimeoutCompareInterrupt(TIMEOUT_TIM13_PIN_PF8);
      }
    }
  }
} /*** end of Timeout8UpdateTimeout13Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer capture channel 8.
** \return    none.
**
****************************************************************************************/
void Timeout8CaptureInterrupt(void)
{
  /* --------------- was it an output compare event for the 1st channel? ------------- */
  if(TIM_GetITStatus(TIM8, TIM_IT_CC1) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM8_PIN_PC6);
  }
  /* --------------- was it an output compare event for the 2nd channel? ------------- */
  else if(TIM_GetITStatus(TIM8, TIM_IT_CC2) == SET)
  {
    /* process the event */
    TimeoutCompareInterrupt(TIMEOUT_TIM8_PIN_PC7);
  }
} /*** end of Timeout8CaptureInterrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 9.
** \return    none.
**
****************************************************************************************/
void Timeout9Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM9, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM9);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM9, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM9_PIN_PE5);
    }
    /* --------------- was it an output compare event for the 2nd channel? ----------- */
    else if(TIM_GetITStatus(TIM9, TIM_IT_CC2) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM9_PIN_PE6);
    }
  }
} /*** end of Timeout9Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 11.
** \return    none.
**
****************************************************************************************/
void Timeout11Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM11, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM11);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM11, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM11_PIN_PF7);
    }
  }
} /*** end of Timeout11Interrupt ***/


/************************************************************************************//**
** \brief     Interrupt service routine for timer channel 14.
** \return    none.
**
****************************************************************************************/
void Timeout14Interrupt(void)
{
  /* --------------- was it a counter overflow event? -------------------------------- */
  if(TIM_GetITStatus(TIM14, TIM_IT_Update) == SET)
  {
    /* process the event */
    TimeoutOverflowInterrupt(TIMEOUT_MODULE_TIM14);
  }
  else
  {
    /* --------------- was it an output compare event for the 1st channel? ----------- */
    if(TIM_GetITStatus(TIM14, TIM_IT_CC1) == SET)
    {
      /* process the event */
      TimeoutCompareInterrupt(TIMEOUT_TIM14_PIN_PF9);
    }
  }
} /*** end of Timeout14Interrupt ***/


/************************************ end of timeout.c *********************************/


